app/controllers/blog_posts_controller.rb

  def index
    @blog_posts = BlogPost.all
---
SELECT "blog_posts".* FROM "blog_posts"

  def create
    @blog_post = BlogPost.new(blog_post_params.merge(user_id: current_user.id))

    respond_to do |format|
      if @blog_post.save
---
INSERT INTO "blog_posts" ("title", "date", "content", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "6k Running Plan"], ["date", "10/28/2019"], ["content", "whatever"], ["created_at", "2019-10-30 22:42:30.682692"], ["updated_at", "2019-10-30 22:42:30.682692"], ["user_id", 4]]

  def update
    respond_to do |format|
      if @blog_post.update(blog_post_params)
---
UPDATE "blog_posts" SET "content" = $1, "updated_at" = $2 WHERE "blog_posts"."id" = $3

  def destroy
    @blog_post.destroy
---
DELETE FROM "blog_posts" WHERE "blog_posts"."id" = $1  [["id", 3]]

    def set_blog_post
      @blog_post = BlogPost.find(params[:id])
---
SELECT "blog_posts".* FROM "blog_posts" WHERE "blog_posts"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]